<template>
  <div class="ckCover" ref="ckCover">
    <p class="pWords" v-for="item in currentList">{{item}}</p>
    <div class="svgContainer">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 463 463" width="40%">
        <path class="robotEye" ref="robotEye0" fill="none" d="M207.5,127c4.143,0,7.5-3.358,7.5-7.5v-8c0-4.142-3.357-7.5-7.5-7.5s-7.5,3.358-7.5,7.5v8
		C200,123.642,203.357,127,207.5,127z"/>
        <path class="robotEye" ref="robotEye1" fill="none" d="M255.5,127c4.143,0,7.5-3.358,7.5-7.5v-8c0-4.142-3.357-7.5-7.5-7.5s-7.5,3.358-7.5,7.5v8
		C248,123.642,251.357,127,255.5,127z"/>
        <path d="M386.854,312.792L375,306.865v-69.099c9.29-3.138,16-11.93,16-22.266c0-12.958-10.542-23.5-23.5-23.5H335v-8.5
		c0-4.142-3.357-7.5-7.5-7.5H311v-40.5c0-26.05-12.595-49.213-32.014-63.721C278.989,71.686,279,71.594,279,71.5V45.766
		c9.29-3.138,16-11.93,16-22.266C295,10.542,284.458,0,271.5,0S248,10.542,248,23.5c0,10.336,6.71,19.128,16,22.266v17.209
		C254.07,58.507,243.076,56,231.5,56s-22.57,2.507-32.5,6.975V45.766c9.29-3.138,16-11.93,16-22.266C215,10.542,204.458,0,191.5,0
		S168,10.542,168,23.5c0,10.336,6.71,19.128,16,22.266V71.5c0,0.094,0.011,0.186,0.014,0.279C164.595,86.287,152,109.45,152,135.5
		V176h-16.5c-4.143,0-7.5,3.358-7.5,7.5v8.5H95.5C82.542,192,72,202.542,72,215.5c0,10.336,6.71,19.128,16,22.266v69.099
		l-11.854,5.927c-2.54,1.27-4.146,3.867-4.146,6.708v24c0,2.841,1.605,5.438,4.146,6.708l16,8c1.077,0.539,2.222,0.793,3.349,0.793
		c2.751,0,5.4-1.52,6.714-4.147c1.853-3.705,0.351-8.21-3.354-10.062L87,338.865v-14.729l8.5-4.25l8.5,4.25V335.5
		c0,4.142,3.357,7.5,7.5,7.5s7.5-3.358,7.5-7.5v-16c0-2.841-1.605-5.438-4.146-6.708L103,306.865V239h25v32.5
		c0,26.05,12.595,49.213,32.014,63.721c-0.003,0.093-0.014,0.185-0.014,0.279v48c0,10.336,6.71,19.128,16,22.266V416h-16.5
		c-2.807,0-5.378,1.566-6.665,4.06L138.415,448H135.5c-4.143,0-7.5,3.358-7.5,7.5s3.357,7.5,7.5,7.5h72c4.143,0,7.5-3.358,7.5-7.5
		v-32c0-4.142-3.357-7.5-7.5-7.5H191v-10.234c9.29-3.138,16-11.93,16-22.266v-32.513c0.167,0.001,0.332,0.013,0.5,0.013h48
		c0.168,0,0.333-0.012,0.5-0.013V383.5c0,10.336,6.71,19.128,16,22.266V416h-16.5c-4.143,0-7.5,3.358-7.5,7.5v32
		c0,4.142,3.357,7.5,7.5,7.5h72c4.143,0,7.5-3.358,7.5-7.5s-3.357-7.5-7.5-7.5h-2.915l-14.42-27.94
		c-1.287-2.494-3.858-4.06-6.665-4.06H287v-10.234c9.29-3.138,16-11.93,16-22.266v-48c0-0.094-0.011-0.186-0.014-0.279
		C322.405,320.713,335,297.55,335,271.5V239h25v67.865l-11.854,5.927c-2.54,1.27-4.146,3.867-4.146,6.708v16
		c0,4.142,3.357,7.5,7.5,7.5s7.5-3.358,7.5-7.5v-11.365l8.5-4.25l8.5,4.25v14.729l-11.854,5.927
		c-3.704,1.852-5.206,6.357-3.354,10.062c1.313,2.628,3.963,4.148,6.714,4.147c1.127,0,2.271-0.255,3.349-0.793l16-8
		c2.54-1.27,4.146-3.867,4.146-6.708v-24C391,316.659,389.395,314.062,386.854,312.792z M271.5,15c4.687,0,8.5,3.813,8.5,8.5
		s-3.813,8.5-8.5,8.5s-8.5-3.813-8.5-8.5S266.813,15,271.5,15z M191.5,15c4.687,0,8.5,3.813,8.5,8.5s-3.813,8.5-8.5,8.5
		s-8.5-3.813-8.5-8.5S186.813,15,191.5,15z M200,448h-44.705l8.774-17H200V448z M307.705,448H263v-17h35.931L307.705,448z
		 M367.5,224c-4.687,0-8.5-3.813-8.5-8.5s3.813-8.5,8.5-8.5s8.5,3.813,8.5,8.5S372.187,224,367.5,224z M231.5,71
		c35.565,0,64.5,28.935,64.5,64.5v8.5H167v-8.5C167,99.935,195.935,71,231.5,71z M167,159h129v17H167V159z M95.5,207
		c4.687,0,8.5,3.813,8.5,8.5s-3.813,8.5-8.5,8.5s-8.5-3.813-8.5-8.5S90.813,207,95.5,207z M117.403,224
		c1.027-2.638,1.597-5.503,1.597-8.5s-0.57-5.862-1.597-8.5H128v17H117.403z M183.5,392c-4.687,0-8.5-3.813-8.5-8.5
		s3.813-8.5,8.5-8.5s8.5,3.813,8.5,8.5S188.187,392,183.5,392z M192,361.597c-2.638-1.027-5.503-1.597-8.5-1.597
		s-5.862,0.57-8.5,1.597v-17.572c5.38,2.421,11.069,4.27,17,5.447V361.597z M143,271.5V191h81v25h-24.5
		c-17.369,0-31.5,14.131-31.5,31.5s14.131,31.5,31.5,31.5H224v57h-16.5C171.935,336,143,307.065,143,271.5z M199.5,264
		c-9.098,0-16.5-7.402-16.5-16.5s7.402-16.5,16.5-16.5h64c9.098,0,16.5,7.402,16.5,16.5s-7.402,16.5-16.5,16.5H199.5z M279.5,392
		c-4.687,0-8.5-3.813-8.5-8.5s3.813-8.5,8.5-8.5s8.5,3.813,8.5,8.5S284.187,392,279.5,392z M288,361.597
		c-2.638-1.027-5.503-1.597-8.5-1.597s-5.862,0.57-8.5,1.597v-12.125c5.931-1.177,11.62-3.026,17-5.447V361.597z M320,271.5
		c0,35.565-28.935,64.5-64.5,64.5H239v-57h24.5c17.369,0,31.5-14.131,31.5-31.5S280.869,216,263.5,216H239v-25h81V271.5z M335,207
		h10.597c-1.027,2.638-1.597,5.503-1.597,8.5s0.57,5.862,1.597,8.5H335V207z" stroke="black" fill="none"
          class="robotBody" ref="robotBody"    stroke-dasharray="3000,3000" />
      </svg>
    </div>
  </div>
</template>

<script>
export default {
  name: "ckCover",
  data(){
    return{
      currentList:["","","",""]
    }
  },
  methods:{
    givenMethod(){
      let list =[
        "计算机是排解寂寞孤独的良药。",
        "在上大学以前我一直把计算机视为电子游戏机，后来python课上老师讲程序我才意识到游戏的背后是不停计算的结果。",
        "计算机知识翰如烟海，有几分钟就能写出的程序，有花了几天也解决不掉的bug。",
        "漫长求知路布满荆棘，望砥砺前行直面困难。"
      ],ele,di = this.$refs.ckCover;
      ele = document.createElement("p");
      ele.style = "line-height:2rem;font-size:1rem"
      di.appendChild(ele);
      const fn = (ele)=>{
        window.fn = setTimeout(()=>{
          ele.innerText += list[0][0];
          list[0] = list[0].slice(1);
          if(!list[0][0]){
            list.splice(0,1);
            if(list.length === 0){
              this.flag = true;
              return ;
            }else{
              ele = document.createElement("p");
              ele.style = "line-height:2rem;font-size:1rem"
              di.appendChild(ele);
              fn(ele);
            }
          }else{
            fn(ele)
          }
        },30);
        return window.fn;
      }
      fn(ele);
    },
    writeWords(index){
      window.ww = setTimeout(()=>{
        if(index > 3){
          this.$refs.robotEye0.style.fill = "black"
          this.$refs.robotEye1.style.fill = "black"
          this.$refs.robotBody.style.fill = "lightsteelblue"
          return;
        }else{
          if(this.currentList[index] === window.ls[index]){
            index += 1;
            this.writeWords(index)
          }else{
            this.currentList.splice(index,1,window.ls[index].slice(0,this.currentList[index].length + 1));
            this.writeWords(index)
          }
        }
      },30)
    }
  },
  created() {
    window.ls = [
      "计算机是排解寂寞孤独的良药。",
      "在上大学以前我一直把计算机视为电子游戏机，后来python课上老师讲程序我才意识到游戏的背后是不停计算的结果。",
      "计算机知识翰如烟海，有几分钟就能写出的程序，有花了几天也解决不掉的bug。",
      "漫长求知路布满荆棘，望砥砺前行直面困难。"
    ]
  },
  mounted() {
    this.writeWords(0);
  },
  beforeDestroy() {
    window.clearTimeout(window.ww);
    window.ls = null;
  }
}
</script>

<style scoped lang="scss">
.ckCover{
  @include size(100%,auto);
  display: flex;
  flex-direction: column;

  .pWords{
    line-height: 2.5rem;
    min-height: 2.5rem;
  }

  .svgContainer{
    @include size(100%,auto);
    display: flex;
    justify-content: center;
    align-items: center;
    margin-top: 1rem;

    .robotBody{
      animation: a1 4s linear;
    }

    @keyframes a1 {
      0%{
        stroke-dashoffset: 3000;
      }
      100%{
        stroke-dashoffset: 0;
      }
    }

    .robotEye{
      transition: all .2s linear;
    }
  }
}
</style>